Repository: fau-klue/ai-act-corpus
Catalog: corpus/tmx_files/AI_Act-EN-PT-Trados.tmx
Source language: en_gb
Languages: pt_pt

source: monitoring the operation of high-risk AI systems referred to in Article 26(5).
pt_pt: O controlo do funcionamento dos sistemas de IA de risco elevado a que se refere o artigo 26.o, n.o 5.

source: For high-risk AI systems referred to in point 1 (a), of Annex III, the logging capabilities shall provide, at a minimum:
pt_pt: Em relação aos sistemas de IA de risco elevado a que se refere o anexo III, ponto 1, alínea a), as capacidades de registo devem incluir, no mínimo:

source: recording of the period of each use of the system (start date and time and end date and time of each use);
pt_pt: O registo do período de cada utilização do sistema (data e hora de início e data e hora de fim de cada utilização);

source: the reference database against which input data has been checked by the system;
pt_pt: A base de dados de referência relativamente à qual os dados de entrada foram verificados pelo sistema;

source: the input data for which the search has led to a match;
pt_pt: Os dados de entrada cuja pesquisa conduziu a uma correspondência;

source: the identification of the natural persons involved in the verification of the results, as referred to in Article 14(5).
pt_pt: A identificação das pessoas singulares envolvidas na verificação dos resultados a que se refere o artigo 14.o, n.o 5.

source: Article 13
pt_pt: Artigo 13.o

source: Transparency and provision of information to deployers
pt_pt: Transparência e prestação de informações aos responsáveis pela implantação

source: High-risk AI systems shall be designed and developed in such a way as to ensure that their operation is sufficiently transparent to enable deployers to interpret a system’s output and use it appropriately.
pt_pt: Os sistemas de IA de risco elevado devem ser concebidos e desenvolvidos de maneira a assegurar que o seu funcionamento seja suficientemente transparente para permitir aos responsáveis pela implantação interpretar os resultados do sistema e utilizá-los de forma adequada.

source: An appropriate type and degree of transparency shall be ensured with a view to achieving compliance with the relevant obligations of the provider and deployer set out in Section 3.
pt_pt: Deve ser garantido um tipo e um grau adequado de transparência com vista a garantir o cumprimento das obrigações pertinentes que incumbem ao prestador e ao responsável pela implantação por força da secção 3.

source: High-risk AI systems shall be accompanied by instructions for use in an appropriate digital format or otherwise that include concise, complete, correct and clear information that is relevant, accessible and comprehensible to deployers.
pt_pt: Os sistemas de IA de risco elevado devem ser acompanhados de instruções de utilização, num formato digital adequado, ou outro, que incluam informações concisas, completas, corretas e claras que sejam pertinentes, acessíveis e compreensíveis para os responsáveis pela implantação.

source: The instructions for use shall contain at least the following information:
pt_pt: As instruções de utilização devem incluir, pelo menos, as seguintes informações:

source: the identity and the contact details of the provider and, where applicable, of its authorised representative;
pt_pt: A identidade e os dados de contacto do prestador e, se for caso disso, do seu mandatário;

source: the characteristics, capabilities and limitations of performance of the high-risk AI system, including:
pt_pt: As características, capacidades e limitações de desempenho do sistema de IA de risco elevado, incluindo:

source: its intended purpose;
pt_pt: a sua finalidade prevista,

source: the level of accuracy, including its metrics, robustness and cybersecurity referred to in Article 15 against which the high-risk AI system has been tested and validated and which can be expected, and any known and foreseeable circumstances that may have an impact on that expected level of accuracy, robustness and cybersecurity;
pt_pt: o nível de exatidão — incluindo os seus parâmetros —, de solidez e de cibersegurança a que se refere o artigo 15.o usado como referência para testar e validar o sistema de IA de risco elevado e que pode ser esperado, bem como quaisquer circunstâncias conhecidas e previsíveis que possam ter um impacto nesse nível esperado de exatidão, solidez e cibersegurança,

source: any known or foreseeable circumstance, related to the use of the high-risk AI system in accordance with its intended purpose or under conditions of reasonably foreseeable misuse, which may lead to risks to the health and safety or fundamental rights referred to in Article 9(2);
pt_pt: qualquer circunstância conhecida ou previsível, relacionada com a utilização do sistema de IA de risco elevado de acordo com a sua finalidade prevista ou em condições de utilização indevida razoavelmente previsível, que possa causar os riscos a que se refere o artigo 9.o, n.o 2, para a saúde e a segurança ou para os direitos fundamentais,

source: where applicable, the technical capabilities and characteristics of the high-risk AI system to provide information that is relevant to explain its output;
pt_pt: se for caso disso, as capacidades técnicas e as características do sistema de IA de risco elevado que sejam pertinentes para explicar os seus resultados,

source: when appropriate, its performance regarding specific persons or groups of persons on which the system is intended to be used;
pt_pt: quando oportuno, o seu desempenho em relação a determinadas pessoas ou grupos de pessoas específicos em que o sistema se destina a ser utilizado,

source: when appropriate, specifications for the input data, or any other relevant information in terms of the training, validation and testing data sets used, taking into account the intended purpose of the high-risk AI system;
pt_pt: quando oportuno, especificações para os dados de entrada, ou quaisquer outras informações importantes em termos dos conjuntos de dados de treino, validação e teste utilizados, tendo em conta a finalidade prevista do sistema de IA de risco elevado,

source: where applicable, information to enable deployers to interpret the output of the high-risk AI system and use it appropriately;
pt_pt: se for caso disso, informações que permitam aos responsáveis pela implantação interpretar os resultados do sistema de IA de risco elevado e utilizá-los adequadamente;

source: the changes to the high-risk AI system and its performance which have been pre-determined by the provider at the moment of the initial conformity assessment, if any;
pt_pt: As alterações do sistema de IA de risco elevado e do seu desempenho que tenham sido predeterminadas pelo prestador aquando da avaliação da conformidade inicial, se for caso disso;

source: the human oversight measures referred to in Article 14, including the technical measures put in place to facilitate the interpretation of the outputs of the high-risk AI systems by the deployers;
pt_pt: As medidas de supervisão humana a que se refere o artigo 14.o, incluindo as soluções técnicas adotadas para facilitar a interpretação dos resultados dos sistemas de IA de risco elevado pelos responsáveis pela implantação;

source: the computational and hardware resources needed, the expected lifetime of the high-risk AI system and any necessary maintenance and care measures, including their frequency, to ensure the proper functioning of that AI system, including as regards software updates;
pt_pt: Os recursos computacionais e de hardware necessários, a vida útil esperada do sistema de IA de risco elevado e quaisquer medidas de manutenção e assistência necessárias, incluindo a sua frequência, para assegurar o correto funcionamento desse sistema de IA, inclusive no tocante a atualizações do software;

source: where relevant, a description of the mechanisms included within the high-risk AI system that allows deployers to properly collect, store and interpret the logs in accordance with Article 12.
pt_pt: Sempre que pertinente, uma descrição dos mecanismos incluídos no sistema de IA de risco elevado que permita aos responsáveis pela implantação recolher, armazenar e interpretar corretamente os registos, em conformidade com o artigo 12.o.

source: Article 14
pt_pt: Artigo 14.o

source: Human oversight
pt_pt: Supervisão humana

source: High-risk AI systems shall be designed and developed in such a way, including with appropriate human-machine interface tools, that they can be effectively overseen by natural persons during the period in which they are in use.
pt_pt: Os sistemas de IA de risco elevado devem ser concebidos e desenvolvidos de modo a poderem, nomeadamente por meio de ferramentas de interface homem-máquina apropriadas, ser eficazmente supervisionados por pessoas singulares durante o período em que estão em utilização.

source: Human oversight shall aim to prevent or minimise the risks to health, safety or fundamental rights that may emerge when a high-risk AI system is used in accordance with its intended purpose or under conditions of reasonably foreseeable misuse, in particular where such risks persist despite the application of other requirements set out in this Section.
pt_pt: A supervisão humana deve procurar prevenir ou minimizar os riscos para a saúde, a segurança ou os direitos fundamentais que possam surgir quando um sistema de IA de risco elevado é usado em conformidade com a sua finalidade prevista ou em condições de utilização indevida razoavelmente previsível, em especial quando esses riscos persistem apesar da aplicação de outros requisitos estabelecidos na presente secção.

source: The oversight measures shall be commensurate with the risks, level of autonomy and context of use of the high-risk AI system, and shall be ensured through either one or both of the following types of measures:
pt_pt: As medidas de supervisão humana devem ser consentâneas com os riscos, ao nível de autonomia e ao contexto de utilização do sistema de IA de risco elevado e a supervisão deve ser assegurada por meio de um ou de todos os seguintes tipos de medidas:

source: measures identified and built, when technically feasible, into the high-risk AI system by the provider before it is placed on the market or put into service;
pt_pt: Medidas identificadas e integradas, quando tecnicamente viável, pelo prestador no sistema de IA de risco elevado antes de este ser colocado no mercado ou colocado em serviço;

source: measures identified by the provider before placing the high-risk AI system on the market or putting it into service and that are appropriate to be implemented by the deployer.
pt_pt: Medidas identificadas pelo prestador antes de o sistema de IA de risco elevado ser colocado no mercado ou colocado em serviço e que se prestem a serem postas em prática pelo responsável pela implantação.

source: For the purpose of implementing paragraphs 1, 2 and 3, the high-risk AI system shall be provided to the deployer in such a way that natural persons to whom human oversight is assigned are enabled, as appropriate and proportionate:
pt_pt: Para efeitos da aplicação dos n.os 1, 2 e 3, o sistema de IA de risco elevado deve ser disponibilizado ao responsável pela implantação de modo a que seja possível às pessoas singulares responsáveis pela supervisão humana, conforme adequado e de forma proporcionada:

source: to properly understand the relevant capacities and limitations of the high-risk AI system and be able to duly monitor its operation, including in view of detecting and addressing anomalies, dysfunctions and unexpected performance;
pt_pt: Compreender adequadamente as capacidades e limitações pertinentes do sistema de IA de risco elevado e conseguir controlar devidamente o seu funcionamento, nomeadamente a fim de detetar e corrigir anomalias, disfuncionalidades e desempenhos inesperados;

source: to remain aware of the possible tendency of automatically relying or over-relying on the output produced by a high-risk AI system (automation bias), in particular for high-risk AI systems used to provide information or recommendations for decisions to be taken by natural persons;
pt_pt: Estar conscientes da possível tendência para confiar automaticamente ou confiar excessivamente nos resultados produzidos pelo sistema de IA de risco elevado (enviesamento da automatização), em especial no que toca a sistemas de IA de risco elevado utilizados para prestar informações ou recomendações com vista à tomada de decisões por pessoas singulares;

source: to correctly interpret the high-risk AI system’s output, taking into account, for example, the interpretation tools and methods available;
pt_pt: Interpretar corretamente os resultados do sistema de IA de risco elevado, tendo em conta, por exemplo, as ferramentas e os métodos de interpretação disponíveis;

source: to decide, in any particular situation, not to use the high-risk AI system or to otherwise disregard, override or reverse the output of the high-risk AI system;
pt_pt: Decidir, em qualquer situação específica, não usar o sistema de IA de risco elevado ou ignorar, anular ou reverter os resultados do sistema de IA de risco elevado;

source: to intervene in the operation of the high-risk AI system or interrupt the system through a ‘stop’ button or a similar procedure that allows the system to come to a halt in a safe state.
pt_pt: Intervir no funcionamento do sistema de IA de risco elevado ou interromper o sistema por meio de um botão de «paragem» ou de um procedimento similar que permita parar o sistema de modo seguro.

source: For high-risk AI systems referred to in point 1(a) of Annex III, the measures referred to in paragraph 3 of this Article shall be such as to ensure that, in addition, no action or decision is taken by the deployer on the basis of the identification resulting from the system unless that identification has been separately verified and confirmed by at least two natural persons with the necessary competence, training and authority.
pt_pt: Em relação aos sistemas de IA de risco elevado a que se refere o anexo III, ponto 1, alínea a), as medidas referidas no n.o 3 do presente artigo devem, além disso, permitir assegurar que nenhuma ação ou decisão seja tomada pelo responsável pela implantação com base na identificação resultante do sistema, salvo se a mesma tiver sido verificada e confirmada separadamente por, pelo menos, duas pessoas singulares com a competência, formação e autoridade necessárias.

source: The requirement for a separate verification by at least two natural persons shall not apply to high-risk AI systems used for the purposes of law enforcement, migration, border control or asylum, where Union or national law considers the application of this requirement to be disproportionate.
pt_pt: O requisito de verificação separada por, pelo menos, duas pessoas singulares não se aplica aos sistemas de IA de risco elevado utilizados para efeitos de aplicação da lei, de migração, de controlo das fronteiras ou de asilo, em que o direito da União ou o direito nacional considere que a aplicação deste requisito é desproporcionada.

source: Article 15
pt_pt: Artigo 15.o

source: Accuracy, robustness and cybersecurity
pt_pt: Exatidão, solidez e cibersegurança

source: High-risk AI systems shall be designed and developed in such a way that they achieve an appropriate level of accuracy, robustness, and cybersecurity, and that they perform consistently in those respects throughout their lifecycle.
pt_pt: Os sistemas de IA de risco elevado devem ser concebidos e desenvolvidos de maneira que alcancem um nível apropriado de exatidão, solidez e cibersegurança e apresentem um desempenho coerente em relação a tais aspetos durante o seu ciclo de vida.

source: To address the technical aspects of how to measure the appropriate levels of accuracy and robustness set out in paragraph 1 and any other relevant performance metrics, the Commission shall, in cooperation with relevant stakeholders and organisations such as metrology and benchmarking authorities, encourage, as appropriate, the development of benchmarks and measurement methodologies.
pt_pt: A fim de abordar os aspetos técnicos relativos à forma de medir os níveis adequados de exatidão e solidez estabelecidos no n.o 1, bem como quaisquer outros parâmetros de desempenho pertinentes, a Comissão, em cooperação com as partes interessadas e as organizações pertinentes, tais como as autoridades responsáveis pela metrologia e pela avaliação comparativa, incentiva, conforme adequado, o desenvolvimento de parâmetros de referência e metodologias de medição.

source: The levels of accuracy and the relevant accuracy metrics of high-risk AI systems shall be declared in the accompanying instructions of use.
pt_pt: As instruções de utilização que acompanham os sistemas de IA de risco elevado devem declarar os níveis de exatidão e os parâmetros de exatidão aplicáveis.

source: High-risk AI systems shall be as resilient as possible regarding errors, faults or inconsistencies that may occur within the system or the environment in which the system operates, in particular due to their interaction with natural persons or other systems.
pt_pt: Os sistemas de IA de risco elevado devem ser tão resistentes quanto possível a erros, falhas ou incoerências que possam ocorrer no sistema ou no ambiente em que aquele opera, em especial devido à interação com pessoas singulares ou outros sistemas.

source: Technical and organisational measures shall be taken in this regard.
pt_pt: A este respeito, devem ser tomadas medidas técnicas e organizativas.

source: The robustness of high-risk AI systems may be achieved through technical redundancy solutions, which may include backup or fail-safe plans.
pt_pt: A solidez dos sistemas de IA de risco elevado pode ser alcançada por via de soluções de redundância técnica, que podem incluir planos de reserva ou planos de segurança à prova de falhas.

source: High-risk AI systems that continue to learn after being placed on the market or put into service shall be developed in such a way as to eliminate or reduce as far as possible the risk of possibly biased outputs influencing input for future operations (feedback loops), and as to ensure that any such feedback loops are duly addressed with appropriate mitigation measures.
pt_pt: Os sistemas de IA de risco elevado que continuam a aprender após serem colocados no mercado ou colocados em serviço são desenvolvidos de forma a eliminar ou reduzir, tanto quanto possível, o risco de resultados possivelmente enviesados que influenciem os dados de entrada de futuras operações (circuitos de realimentação), bem como a assegurar que esses resultados possivelmente enviesados sejam objeto de medidas de atenuação adequadas.

source: High-risk AI systems shall be resilient against attempts by unauthorised third parties to alter their use, outputs or performance by exploiting system vulnerabilities.
pt_pt: Os sistemas de IA de risco elevado devem ser resistentes a tentativas de terceiros não autorizados de alterar a sua utilização, os seus resultados ou seu desempenho explorando as vulnerabilidades do sistema.

source: The technical solutions aiming to ensure the cybersecurity of high-risk AI systems shall be appropriate to the relevant circumstances and the risks.
pt_pt: As soluções técnicas destinadas a assegurar a cibersegurança dos sistemas de IA de risco elevado devem ser adequadas às circunstâncias e aos riscos de cada caso.

source: The technical solutions to address AI specific vulnerabilities shall include, where appropriate, measures to prevent, detect, respond to, resolve and control for attacks trying to manipulate the training data set (data poisoning), or pre-trained components used in training (model poisoning), inputs designed to cause the AI model to make a mistake (adversarial examples or model evasion), confidentiality attacks or model flaws.
pt_pt: As soluções técnicas para resolver vulnerabilidades específicas da IA devem incluir, se for caso disso, medidas para prevenir, detetar, resolver e controlar, bem como dar resposta a ataques que visem manipular o conjunto de dados de treino (contaminação de dados) ou componentes pré-treinados utilizados no treino (contaminação de modelos), dados de entrada concebidos para fazer com que o modelo de IA cometa um erro (exemplos antagónicos ou evasão de modelos), ataques de confidencialidade ou falhas do modelo.

source: Obligations of providers and deployers of high-risk AI systems and other parties
pt_pt: Obrigações dos prestadores e dos responsáveis pela implantação de sistemas de IA de risco elevado e de outras partes

source: Article 16
pt_pt: Artigo 16.o

source: Obligations of providers of high-risk AI systems
pt_pt: Obrigações dos prestadores de sistemas de inteligência artificial de risco elevado

source: Providers of high-risk AI systems shall:
pt_pt: Os prestadores de sistemas de IA de risco elevado devem:

source: ensure that their high-risk AI systems are compliant with the requirements set out in Section 2;
pt_pt: Assegurar que os seus sistemas de IA de risco elevado cumpram os requisitos estabelecidos na secção 2;

source: indicate on the high-risk AI system or, where that is not possible, on its packaging or its accompanying documentation, as applicable, their name, registered trade name or registered trade mark, the address at which they can be contacted;
pt_pt: Indicar no sistema de IA de risco elevado ou, se tal não for possível, na embalagem ou na documentação que o acompanha, consoante o caso, o seu nome, o nome comercial registado ou a marca registada e o endereço no qual podem ser contactados;

source: have a quality management system in place which complies with Article 17;
pt_pt: Dispor de um sistema de gestão da qualidade que cumpra o disposto no artigo 17.o;

source: keep the documentation referred to in Article 18;
pt_pt: Conservar a documentação nos termos do artigo 18.o;

source: when under their control, keep the logs automatically generated by their high-risk AI systems as referred to in Article 19;
pt_pt: Quando tal esteja sob o seu controlo, manter os registos gerados automaticamente pelos sistemas de IA de risco elevado que disponibilizam, conforme previsto no artigo 19.o;

source: ensure that the high-risk AI system undergoes the relevant conformity assessment procedure as referred to in Article 43, prior to its being placed on the market or put into service;
pt_pt: Assegurar que o sistema de IA de risco elevado seja sujeito ao procedimento de avaliação da conformidade aplicável, tal como previsto no artigo 43.o, antes da colocação no mercado ou da colocação em serviço;

source: draw up an EU declaration of conformity in accordance with Article 47;
pt_pt: Elaborar uma declaração UE de conformidade, nos termos do artigo 47.o;

source: affix the CE marking to the high-risk AI system or, where that is not possible, on its packaging or its accompanying documentation, to indicate conformity with this Regulation, in accordance with Article 48;
pt_pt: Apor a marcação CE no sistema de IA de risco elevado ou, se tal não for possível, na embalagem ou na documentação que o acompanha, para indicar a conformidade com o presente regulamento, nos termos do artigo 48.o;

source: comply with the registration obligations referred to in Article 49(1);
pt_pt: Respeitar as obrigações de registo a que se refere o artigo 49.o, n.o 1;

source: take the necessary corrective actions and provide information as required in Article 20;
pt_pt: Adotar as medidas corretivas necessárias e prestar as informações, tal como estabelecido no artigo 20.o;
